const quizData = [
    {
        question: "தமிழ்நாட்டின் தலைநகரம் எது?",
        options: ["மதுரை", "கோயம்புத்தூர்", "சென்னை", "திருச்சி"],
        correctAnswer: 2
    },
    {
        question: "இந்தியாவின் தேசிய பறவை எது?",
        options: ["கிளி", "மயில்", "காகம்", "புறா"],
        correctAnswer: 1
    },
    {
        question: "சூரியன் உதிக்கும் திசை எது?",
        options: ["மேற்கு", "வடக்கு", "தெற்கு", "கிழக்கு"],
        correctAnswer: 3
    },
    {
        question: "ஒரு வாரத்திற்கு எத்தனை நாட்கள்?",
        options: ["5", "6", "7", "8"],
        correctAnswer: 2
    },
    {
        question: "மனித உடலின் முக்கிய பம்ப் எது?",
        options: ["மூளை", "இதயம்", "நுரையீரல்", "வயிறு"],
        correctAnswer: 1
    },
    {
        question: "இந்தியாவின் முதல் பிரதமர் யார்?",
        options: ["மகாத்மா காந்தி", "ஜவஹர்லால் நேரு", "அம்பேத்கர்", "சுபாஷ் சந்திர போஸ்"],
        correctAnswer: 1
    },
    {
        question: "நமது தேசிய மலர் எது?",
        options: ["ரோஜா", "மல்லிகை", "தாமரை", "சூரியகாந்தி"],
        correctAnswer: 2
    },
    {
        question: "ஒரு வருடத்தில் எத்தனை மாதங்கள்?",
        options: ["10", "11", "12", "13"],
        correctAnswer: 2
    },
    {
        question: "முக்கனிகளில் ஒன்று எது?",
        options: ["ஆப்பிள்", "மா", "திராட்சை", "ஆரஞ்சு"],
        correctAnswer: 1
    },
    {
        question: "பால் என்ன நிறம்?",
        options: ["கருப்பு", "நீலம்", "சிவப்பு", "வெள்ளை"],
        correctAnswer: 3
    },
    {
        question: "எந்த விலங்கு பாலைவனத்தின் கப்பல் எனப்படுகிறது?",
        options: ["குதிரை", "ஒட்டகம்", "யானை", "கழுதை"],
        correctAnswer: 1
    },
    {
        question: "கண்களால் நாம் என்ன செய்கிறோம்?",
        options: ["கேட்கிறோம்", "பேசுகிறோம்", "பார்க்கிறோம்", "சுவாசிக்கிறோம்"],
        correctAnswer: 2
    },
    {
        question: "மரத்தில் உள்ள இலைகளின் நிறம் என்ன?",
        options: ["பச்சை", "மஞ்சள்", "நீலம்", "சிவப்பு"],
        correctAnswer: 0
    },
    {
        question: "நமது தேசிய விலங்கு எது?",
        options: ["சிங்கம்", "புலி", "யானை", "கரடி"],
        correctAnswer: 1
    },
    {
        question: "வானத்தின் நிறம் என்ன?",
        options: ["பச்சை", "நீலம்", "சிவப்பு", "கருப்பு"],
        correctAnswer: 1
    }
];
